---
kind: method
id: M:Autodesk.Revit.DB.ExclusionFilter.GetIdsToExclude
source: html/f8562b02-0777-e3da-e783-2cb6c04c9253.htm
---
# Autodesk.Revit.DB.ExclusionFilter.GetIdsToExclude Method

Returns the ids to be excluded by this filter.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetIdsToExclude()
```

## Returns
The collection of ids to exclude.